# IsInstanceFlipped Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdaptiveComponentInstanceUtils..::..IsInstanceFlipped Method
AdaptiveComponentInstanceUtils Class See Also
---
Gets the value of the flip parameter on the adaptive instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool IsInstanceFlipped(
	FamilyInstance famInst
)
```

Visual Basic
---
```text
Public Shared Function IsInstanceFlipped ( _
	famInst As FamilyInstance _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsInstanceFlipped(
	FamilyInstance^ famInst
)
```

# ### Parameters
famInst
    Type: Autodesk.Revit.DB..::..FamilyInstance The FamilyInstance
# ### Return Value
True if the instance is flipped.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The FamilyInstance famInst is not an Adaptive Family Instance. -or- The FamilyInstance famInst does not have an Adaptive Family Symbol. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace